arch_inst.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-01-29 Sun 17:00 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Archlinux - Installation</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Archlinux - Installation</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org051e92b">Preparation</a></li>
<li><a href="#org4ccd5a0">Installation</a>
<ul>
<li><a href="#org5eec71b">Select the suitable architecture</a></li>
<li><a href="#org069d952">Partition disk</a></li>
<li><a href="#orgb61c120">Format the partitions</a></li>
<li><a href="#org2f68e0e">Mount the partitions</a></li>
<li><a href="#org9752e0b">Configure network</a></li>
<li><a href="#org904d617">Select nearest mirror</a></li>
<li><a href="#orga7d9134">Install the base system and necessary applications</a></li>
<li><a href="#org51af301">Generate fstab file</a></li>
<li><a href="#orgaa0b035">Chroot into the newly installed system</a></li>
<li><a href="#org669de0b">Set hostname</a></li>
<li><a href="#org3afc79e">Set time zone</a></li>
<li><a href="#orgb2a9555">Set system time</a></li>
<li><a href="#orgc0473e9">Set locale</a></li>
<li><a href="#orgdf7a20c">Create an initial RAM disk</a></li>
<li><a href="#orgef5aad1">Install bootloader</a></li>
<li><a href="#org397feea">Configure network for the newly installed OS</a></li>
<li><a href="#org93d9f3f">Configure SSH service</a></li>
<li><a href="#org897b61d">Configure CPU frequency scaling</a></li>
<li><a href="#org4c2b696">Set password for root</a></li>
<li><a href="#orgd0437d0">Unmount and reboot</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org051e92b" class="outline-2">
<h2 id="org051e92b">Preparation</h2>
<div class="outline-text-2" id="text-org051e92b">
<ol class="org-ol">
<li>Insert the DVD into the optical driver and reboot the computer.</li>
<li>In the power-on self-test (POST) stage, press <code>F11</code> <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> on the screen of BIOS splash to boot the computer from the DVD.</li>
</ol>
</div>
</div>
<div id="outline-container-org4ccd5a0" class="outline-2">
<h2 id="org4ccd5a0">Installation</h2>
<div class="outline-text-2" id="text-org4ccd5a0">
</div>
<div id="outline-container-org5eec71b" class="outline-3">
<h3 id="org5eec71b">Select the suitable architecture</h3>
<div class="outline-text-3" id="text-org5eec71b">
<p>
When Arch Linux splash appears, choose <code>Boot Arch Linux (x86_64)</code>.
</p>
</div>
</div>
<div id="outline-container-org069d952" class="outline-3">
<h3 id="org069d952">Partition disk</h3>
<div class="outline-text-3" id="text-org069d952">
<p>
Divide the entire disk into several partitions, e.g. four partitions for <code>/</code>, <code>/var</code>, <code>/tmp</code>, <code>/home</code>, respectively. What deserves your attention, <code>/</code> should be set bootable. With respect to the partition tool, you have so many choices, e.g. <code>fdisk</code>, <code>cfdisk</code>. Without loss of generality, we take <code>cfdisk</code> for instance here.
</p>
<div class="org-src-container">
<pre class="src src-sh">cfdisk /dev/sda
</pre>
</div>
<p>
For example, we have divided the disk into four partitions, e.g. <code>/sda1</code>, <code>/sda5</code>, <code>/sda6</code>, <code>/sda7</code> <sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.
</p>
</div>
</div>
<div id="outline-container-orgb61c120" class="outline-3">
<h3 id="orgb61c120">Format the partitions</h3>
<div class="outline-text-3" id="text-orgb61c120">
<div class="org-src-container">
<pre class="src src-sh">mkfs.ext4 /dev/sda1
mkfs.ext4 /dev/sda5
mkfs.ext4 /dev/sda6
mkfs.ext4 /dev/sda7
</pre>
</div>
</div>
</div>
<div id="outline-container-org2f68e0e" class="outline-3">
<h3 id="org2f68e0e">Mount the partitions</h3>
<div class="outline-text-3" id="text-org2f68e0e">
<div class="org-src-container">
<pre class="src src-sh">mount -t ext4 /dev/sda1 /mnt
mkdir -p /mnt/{var,tmp,home}
mount -t ext4 /dev/sda5 /mnt/var
mount -t ext4 /dev/sda6 /mnt/tmp
mount -t ext4 /dev/sda7 /mnt/home
</pre>
</div>
</div>
</div>
<div id="outline-container-org9752e0b" class="outline-3">
<h3 id="org9752e0b">Configure network</h3>
<div class="outline-text-3" id="text-org9752e0b">
<div class="org-src-container">
<pre class="src src-sh">systemctl stop dhcpcd
ip addr add IP_ADDR/24 broadcast BROADCAST_ADDR dev eth0
ip route add default via GATEWAY_IP_ADDR
export http_proxy="http://PROXY_IP_ADDR:PORT"
export https_proxy="https://PROXY_IP_ADDR:PORT"
echo nameserver DNS_SERVER_IP_ADDR &gt;&gt; /etc/resolv.conf
</pre>
</div>
</div>
</div>
<div id="outline-container-org904d617" class="outline-3">
<h3 id="org904d617">Select nearest mirror</h3>
<div class="outline-text-3" id="text-org904d617">
<p>
Edit <code>/etc/pacman.d/mirrorlist</code> as
</p>
<div class="org-src-container">
<pre class="src src-sh">Server = http://mirrors.163.com/archlinux/$repo/os/$arch
</pre>
</div>
</div>
</div>
<div id="outline-container-orga7d9134" class="outline-3">
<h3 id="orga7d9134">Install the base system and necessary applications</h3>
<div class="outline-text-3" id="text-orga7d9134">
<div class="org-src-container">
<pre class="src src-sh">pacstrap /mnt base base-devel os-prober grub openssh nfs-utils boost cpupower libxml2 ntp
</pre>
</div>
</div>
</div>
<div id="outline-container-org51af301" class="outline-3">
<h3 id="org51af301">Generate fstab file</h3>
<div class="outline-text-3" id="text-org51af301">
<div class="org-src-container">
<pre class="src src-sh">genfstab -p /mnt &gt;&gt; /mnt/etc/fstab
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaa0b035" class="outline-3">
<h3 id="orgaa0b035">Chroot into the newly installed system</h3>
<div class="outline-text-3" id="text-orgaa0b035">
<div class="org-src-container">
<pre class="src src-sh">arch-chroot /mnt
</pre>
</div>
</div>
</div>
<div id="outline-container-org669de0b" class="outline-3">
<h3 id="org669de0b">Set hostname</h3>
<div class="outline-text-3" id="text-org669de0b">
<div class="org-src-container">
<pre class="src src-sh">echo COMPUTER_NAME &gt; /etc/hostname
</pre>
</div>
</div>
</div>
<div id="outline-container-org3afc79e" class="outline-3">
<h3 id="org3afc79e">Set time zone</h3>
<div class="outline-text-3" id="text-org3afc79e">
<div class="org-src-container">
<pre class="src src-sh">ln -s /usr/share/zoneinfo/Asia/Shanghai /etc/localtime
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb2a9555" class="outline-3">
<h3 id="orgb2a9555">Set system time</h3>
<div class="outline-text-3" id="text-orgb2a9555">
<p>
Prepend following line to <code>/etc/ntp.conf</code>
</p>
<div class="org-src-container">
<pre class="src src-sh">server head
</pre>
</div>
<p>
Enable the network time service
</p>
<div class="org-src-container">
<pre class="src src-sh">systemctl enable ntpd.service
systemctl start ntpd.service
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc0473e9" class="outline-3">
<h3 id="orgc0473e9">Set locale</h3>
<div class="outline-text-3" id="text-orgc0473e9">
<p>
Edit <code>/etc/locale.gen</code> and uncomment the following lines
</p>
<div class="org-src-container">
<pre class="src src-sh">...
en_US.UTF-8 UTF-8
en_US ISO-8859-1
...
zh_CN.GB18030 GB18030
zh_CN.GBK GBK
zh_CN.UTF-8 UTF-8
zh_CN GB2312
...
</pre>
</div>
<p>
Generate and set locales
</p>
<div class="org-src-container">
<pre class="src src-sh">locale-gen
echo LANG=en_US.UTF-8 &gt; /etc/locale.conf
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdf7a20c" class="outline-3">
<h3 id="orgdf7a20c">Create an initial RAM disk</h3>
<div class="outline-text-3" id="text-orgdf7a20c">
<div class="org-src-container">
<pre class="src src-sh">mkinitcpio -p linux
</pre>
</div>
</div>
</div>
<div id="outline-container-orgef5aad1" class="outline-3">
<h3 id="orgef5aad1">Install bootloader</h3>
<div class="outline-text-3" id="text-orgef5aad1">
<div class="org-src-container">
<pre class="src src-sh">grub-install --recheck /dev/sda
grub-mkconfig -o /boot/grub/grub.cfg
</pre>
</div>
</div>
</div>
<div id="outline-container-org397feea" class="outline-3">
<h3 id="org397feea">Configure network for the newly installed OS</h3>
<div class="outline-text-3" id="text-org397feea">
<p>
Edit <code>/etc/profile</code> and append following two lines to configure the proxy server.
</p>
<div class="org-src-container">
<pre class="src src-sh">...
export http_proxy="http://PROXY_IP_ADDR:PORT"
export https_proxy="https://PROXY_IP_ADDR:PORT"
</pre>
</div>
<p>
Create file <code>/etc/netctl/ethernet_static</code> with its content
</p>
<div class="org-src-container">
<pre class="src src-sh">Description='A static ethernet connection'
Interface=enp1s0f0
Connection=ethernet
IP=static
Address=('IP_ADDR/24')
Gateway='GATEWAY_ADDR'
DNS=('DNS_SERVER_IP_ADDR')
</pre>
</div>
<p>
Enable the network configuration
</p>
<div class="org-src-container">
<pre class="src src-sh">netctl enable ethernet_static
</pre>
</div>
</div>
</div>
<div id="outline-container-org93d9f3f" class="outline-3">
<h3 id="org93d9f3f">Configure SSH service</h3>
<div class="outline-text-3" id="text-org93d9f3f">
<p>
Edit file <code>/etc/ssh/sshd_config</code> as below
</p>
<div class="org-src-container">
<pre class="src src-sh">...
PermitRootLogin yes
...
</pre>
</div>
<p>
Enable the SSH service
</p>
<div class="org-src-container">
<pre class="src src-sh">systemctl enable sshd.service
</pre>
</div>
</div>
</div>
<div id="outline-container-org897b61d" class="outline-3">
<h3 id="org897b61d">Configure CPU frequency scaling</h3>
<div class="outline-text-3" id="text-org897b61d">
<div class="org-src-container">
<pre class="src src-sh">systemctl enable cpupower
</pre>
</div>
</div>
</div>
<div id="outline-container-org4c2b696" class="outline-3">
<h3 id="org4c2b696">Set password for root</h3>
<div class="outline-text-3" id="text-org4c2b696">
<div class="org-src-container">
<pre class="src src-sh">passwd
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd0437d0" class="outline-3">
<h3 id="orgd0437d0">Unmount and reboot</h3>
<div class="outline-text-3" id="text-orgd0437d0">
<div class="org-src-container">
<pre class="src src-sh">exit
umount -R /mnt
reboot
</pre>
</div>
<p>
Congratulation! So far, you have finished the installation of the base system of Arch Linux as a server. You can leave the server room and access the newly installed Linux server remotely for further configuration.
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
For some BIOS, it maybe <code>F1</code>, <code>F2</code>, <code>F12</code> or other keys.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Possibly, the partitions are not exactly the same as the case you encountered, esp. in the case of co-existence with Windows OS.
</p></div></div>


</div>
</div></div>
</body>
</html>